{"texts": ["Is getting a good grade enough to ask for a letter of recommendation for a grad school application?", "I'm about to start a 5th year Master's program in CS at my university (one extra year after B.S. for a M.S.). I've also been looking at applying to grad schools for a PhD program, and the main thing that I've been worried about is recommendation letters.\n\nI know one professor somewhat well (took two classes with her, one of which was a project class where I presented to her) and I think she would be willing to write a rec letter. However, she's fairly well known in her field and I don't know if that makes it harder to get a rec from her.\n\nBut, most of the colleges I'm looking at for grad school need three letters. I've had good grades throughout my undergrad, mostly 3.9 and 4.0s. Because I was fairly comfortable with my classes, I rarely went to office hours. As a result, I don't think any of the professors who've taught me know anything about me other than that I was in their class and that I did well.\n\nI'm totally unsure now about how to proceed. Is it normal for professors to be asked for rec letters by students they only maybe recognize? Do they usually say yes or no? What are my options?"], "tags": ["graduate-admissions", "application", "computer-science", "recommendation-letter"]}
{"texts": ["Why would a professor (say in pure math) want to take PhD students?", "Why would a professor doing pure math/ theoretical computer science want to take PhD students?\n\nI understand that in computational and experimental sciences taking students is at least beneficial to them. However, in subjects like pure math, it is not obvious to me that there are any significant advantages to take some PhD students. It is probably expected from the department that you will take some students, and it is nice to have someone who can type things up for you. But other than that, I don't see any reasons.\n\nSo, why would they want to do that? What are they expecting from their (prospective) students?"], "tags": ["phd", "mathematics", "professors"]}
{"texts": ["Which term is correct for a work submitted for a master's degree: paper, thesis or dissertation?", "What is the difference among the terms paper, thesis and dissertation?  Which one should I use, for instance if I am completing a master's degree? Are they interchangeable ?"], "tags": ["publications", "thesis"]}
{"texts": ["Graduating this year and not sure what type of grad school to pursue?", "How did you all decide that graduate school, and specifically the field you're studying in graduate school, was the right choice?\nI'm a senior at an excellent university studying Bioengineering. I think I'm a pretty odd case, as my passions have always been reading and creative writing, but I chose to study a flexible hard science as it would provide at least a little more use for the degree, and bioengineering was the most broad. As a result, though, I've always been open to a lot of career paths and have had a lot of trouble figuring out what I want to do. Going into my last year I've done really well in classes (3.95+ GPA), but I never found the subject to be something I was super passionate about: I was more just decently interested. My GPA, in combination with my research experience and volunteer work, has made me at least a viable candidate for law schools, med schools, and Bioengineering graduate programs (probably just a masters), and these three choices are quite different and career-defining.\nMy rationale for considering these programs and not just heading into the work-force is that going to top programs for any of these (especially law and med school) would allow me to rise significantly higher professionally and perhaps find more fulfilling work. A masters in bioengineering would allow me to specialize in the field (the BE field itself has options in which to specialize) more which would definitely improve my job prospects as well. Just thinking about deciding between all of this is seriously anxiety-inducing, and has always been for me since I entered college. They all seem somewhat appealing, and they all come with the con of &quot;What if I made the wrong choice and would have been better in that other field?&quot; While I know you can always switch afterwards or do multiple, practically and financially speaking that's far from ideal.\nGiven all this information, I ask you academics, who in my experience are some of the most focused, committed, and driven people in the world, how did you decide on what you wanted to do and make that commitment?"], "tags": ["career-path"]}
{"texts": ["Is there a resource that gives the number of citations per scientist in various countries?", "The motivation for this question is attempting to quantify the quality of science in a country.  Getting at quality is difficult, but the number of citations is one way of trying to do so.  Is there any available resource that has computed the number of citations per scientist in various countries?"], "tags": ["citations", "reference-request", "bibliometrics"]}
{"texts": ["What does it take to get a worthwhile recommendation letter", "I am now looking for people to write recommendation letters for me so as to prepare for graduate school application by the end of this year. I found I still need one more person(I want to have 3 letters, as is required by almost all US graduate schools), but I don't know what does it take to get a recommendation letter that is worthwhile? I mean, is it OK to ask a professor write a recommendation letter for you only based on your behavior in his/her class? or you must do research with a professor for some time so that the letter can contain something really meaningful? (The problem I have with the second choice is that I am already participating research with a professor, and I guess it is not a good idea to distract myself to another professor's field at this time.)"], "tags": ["graduate-admissions", "recommendation-letter"]}
{"texts": ["\"Duke University Press\" vs \"Duke University Press Books\"", "Which of these bibliography citations is preferred?:\n\n\n  Weld, Kirsten. Paper Cadavers: The Archives of Dictatorship in Guatemala. Durham: Duke University Press, 2014.\n  \n  Weld, Kirsten. Paper Cadavers: The Archives of Dictatorship in Guatemala. Durham: Duke University Press Books, 2014.\n\n\nGoogle shows both forms are in use for this particular book (and many like it). \n In total, Google yields 442,000 results for \"Durham: Duke University Press\" and 14,200 results for \"Durham: Duke University Press Books.\" Why are there two competing forms?"], "tags": ["citations"]}
{"texts": ["What references must be acknowledged in a paper?", "This question came up from a discussion on meta.MSE.\n\nMy question is: \n\n\n  Do we need to search MSE (or blogs, math forums, ...) to make sure someone hasn't already proven a result when writing a paper? \n  \n  What if we are already aware of a them (so no need for searching)?\n  \n  Is not citing such a post in these two cases considered plagiarism?\n\n\nAs I understand, the common practice is to check standard reviewed reputable publication venues (journals, conferences, maybe arXiv) and also with experts in the area to make sure a result is not already published nor a well-known folklore result. No one is going to search all over the internet and check every post that Google returns and citing other resources is very uncommon. I think checking MatheOverflow can be considered similar to the later (checking with experts) (also see this discussion on MO but that doesn't seem to apply to a site like MSE. I am not going to cite a discussion with some random person on the street (not a professional mathematician) who claimed to have a solution or an idea for a solution for a problem (which is not passed peer-review process and I might not want even want to spend time understanding or checking the correctness of the solution).\n\n\n  What are the accepted practice for checking originality of a result? \n  \n  What is expected from authors regarding this before making a paper submission?\n\n\n\n\nSome clarification since there seems to be a misinterpretation of the question about being academic honesty. The question is not about posts that\n\n\nyou are aware of,\ncontain a complete rigorousness solution (not just ideas), and\nyou are confident the solution is correct."], "tags": ["publications", "authorship", "plagiarism"]}
{"texts": ["Do authors appreciate the work of peer reviewers?", "It’s International Peer Review Week, and this year’s theme is “Recognition for Review.” This makes me wonder whether authors feel a sense of appreciation for their reviewers. As an author, I have always felt intimidated or depressed by peer review. But on some reflection, I feel that reviewers have actually helped me improve my papers. Have you ever felt a sense of appreciation and gratitude for your reviewers? If you had the opportunity to write a note of thanks to your reviewers today, what would you write?"], "tags": ["research-process", "journals", "peer-review", "academic-life"]}
{"texts": ["How to answer a professor when you ask for an opportunity to do your Ph.D. and the first contact is positive", "Well, I sent a message to a professor asking for an opportunity in its research group aiming to start my Ph.D. (in a major university, top 25 in the world).  I sent as attached files my résumé, my research papers as usual on this kind of messages (but I sent the mail with no hope to be answered). Nonetheless, in four hours (in a Saturday if this information helps to the analysis), I have received a response stimulating me to apply (and saying that they are always looking for good students to do research there) and copying this answer to de Ph.D. coordinator program. However, as I sent this message just to know about my chances (before, I have read his papers and résumé of course) I was planning to apply to the Ph.D. only at the end of 2018 (but that answer really surprised me). So the questions are:\n\n1) Is that answer usual? I mean, answering me and \"ccing\" the Ph.D. coordinator is a good sign or not? Or is this a polite way to answer me? Usually, if your résumé is really good, the professors schedule a call by phone or skype (or is this not a standard?)\n\n2) How to inform them that I would like to apply to de Ph.D. only at the end of next year (because I don't have all the documents and the deadline to apply is December 15th), without prejudice about our conversations? \n\n3) What are the next steps? (any suggestion will be kindly appreciated). I confess I'm quite lost how to proceed."], "tags": ["graduate-admissions"]}
{"texts": ["Impact Factor vs 5-year Impact Factor", "In ISI Web of Knowledge Journal Citation Report, we can find any journal Impact Factor (IF) and 5-Years Impact Factor (IF5), which is, as far as I get it, the Impact Factor over the last 5 years (well, the name is quite self-descriptive...).\n\nWhat interests me is the difference between both indexes. I was wondering how to analyse this difference. If IF > IF5, does it means the journal IF is globally increasing? \n\nAnd which one is more accurate while evaluating a journal?"], "tags": ["bibliometrics", "impact-factor"]}
{"texts": ["Adding ResearchGate profile to Resume?", "It is common that people add their LinkedIn profile in their resumes. On the other hand, they add profiles (like ResearcherID) counting publications, citations, and showing factors such as h-index.\n\nResearchGate is something in-between, but I have not seen if anyone add his/her ResearchGate profile link in resume. Is it because ResearchGate is young and not popular, or it is not technically convenient?"], "tags": ["cv", "website", "social-media"]}
{"texts": ["What is the work load of a journal reviewing editor?", "I was wandering what was the work load of a journal reviewing editor? More precisely, if someone would like to apply for such a position, how much time is required to do the job correctly?\n\nI am of course aware that it might highly depend on the type of journal and/or field of research, but I would like to have some general feedback / experiences / advices.\n\nThanks to all!"], "tags": ["publications", "journals", "peer-review", "editors"]}
{"texts": ["How to make data management plans machine readable?", "More and more research projects are now required to have a data management plan, sometimes already upon submission of the proposal, sometimes early into the then funded project. \n\nThese plans lay out the kinds and amounts of data to be generated by the project, as well as information about their storage, archiving, accessibility and related questions. There are also software management plans or more generic project management plans, which serve similar purposes.\n\nA big issue with these plans &mdash; which so far are usually just text documents, and often not even public ones &mdash; is monitoring compliance, i.e. if statements made in the plan have been followed up by appropriate action.\n\nI think this problem could be eased substantially if these plans were both public and machine readable, which would also allow them to be used for things other than monitoring compliance, e.g. as a discovery tool &mdash; imagine you could subscribe to the feed of all data of kind X acquired from sources of kind Y. \n\nWhat I mean by machine readability is expressed quite well in the introductory part of the Wikipedia article \"Machine-readable data\": \n\n\n  \"Machine-readable data is data (or metadata) which is in a format that \n  can be understood by a computer. There are two types; human-readable \n  data that is marked up so that it can also be read by machines \n  (examples; microformats, RDFa) or data file formats intended \n  principally for processing by machines (RDF, XML, JSON).\n  \n  Machine readable is not synonymous with digitally accessible. A \n  digitally accessible document may be online, making it easier for a \n  human to access it via a computer, but unless the relevant data is \n  available in a machine readable format, it will be much harder to use \n  the computer to extract, transform and process that data.\"\n\n\nAny advice on how best to go about achieving machine readability for data management plans?\n\nI am aware of https://dmponline.dcc.ac.uk/ and https://dmp.cdlib.org/ but as far as I can tell, their machine readability is limited to non-existant."], "tags": ["data"]}
{"texts": ["Publishing an almost trivial paper to arxiv", "My question is simple:\n\nShould I publish a paper on arxiv if the result is almost trivial or just an analysis of the known results with a new question in mind? Other than the main question I am answering (which could lead to some extensions) there does not seem to be an interesting idea."], "tags": ["computer-science", "arxiv"]}
{"texts": ["UK Grading to US GPA conversion", "I analysed admission requirements for Master course in the US university and found that one of them is GPA from an undergraduate course. \n\nI am studying Electrical and Electronic Engineering at the University of Manchester in the United Kingdom where the final grade is composed of the second and the third-year grades. \n\nIn more detail, the first year does not count towards the final grade, the second year makes 25% of the final grade and the third year contributes to the 75% of the final grade. Each year contains 120 credits split between modules and marks for each module are given in percentage.\n\nCould you please tell how my GPA, scaled from 0 to 4, would be calculated in this situation?"], "tags": ["gpa"]}