{"texts": ["mounting an app folder to external storage fails for Write access on Android Q but will work in Android Pie", "I could mount my partitions holding whatsapp (exFat) and titanium  ( ext4 ) backup data on android Pie  but right now on Q  it will not let a RW operation be performed after mounting \nI understand /sdcard is a virtual emulated FS and the fact that there are app specific views etc. But after going through all that perplexing stuff, I couldn't crystallize on a working solution. \nI've gone through a related Q on stack but none of these approaches work for me.\nSo lemme explain a bit where I come from :\n\n{} I can successfully bind mount /storage/emulated/0/WhatsApp to exFat /storage/[UUID]/WhatsApp for RW. Obviously because exFat is Permission unaware file system. Did a regular mount and it will mount to /mnt/media/runtime/[Read &amp; Write &amp; Full &amp;  Default] with 3 separate 'mask' options mask==6 , 7 and 23 ( BTW that mask option isn't quite your umask . Its 'decimalized' umask -convert that 7 to binary to get real umask ). So in fact it invokes the same path as mentioned in the article behind the covers viz  /mnt/media/runtime/[Read &amp; Write &amp; Full &amp;  Default] \n\n{} I need to similarly mount  an ext4 partition with Titanium backup. Here are the issues.\nIf I mount  /storage/emulated/0/Titanium to ext4 /storage/[UUID]/Titanium  ( like I mentioned in fact it mounts to /mnt/media/runtime/[Read &amp; Write &amp; Full &amp;  Default] with 3 separate 'mask' options  underneath. With this mount. I can  Restore Apps but cant backup Apps. So R is allowed RW is not and I granted Titanium Root access. Maybe the explorer components of that apps are not using Root level access. \nSomewhere i read - mount using correct options of sdcardfs and 'fuse`. My question is precisely How ?\n\n\n{} I found somewhere a bindfs binary but it does not work with my  CPU Architecture \n\n{} Now with everything the same I Could RW using above approach in Android Pie . This is an issue with Android Q ...what changed ? how do I work around ?"], "tags": ["storage", "permissions", "mount", "partitions", "bind-mount"]}
{"texts": ["Application loss problem", "Why are applications lost when rebooting?\n\nIn every reboot this happens\n\nNote: The LG G4 suffers from other problems such as the sudden stop of the Power button and also the high brightness ratio at reboot, which requires manually resetting the automatic light\n\n\n\nDivce name : LG G4 H818P\n\nProcessor : Snapdragon 808\n\nVersion year : 2015\n\nVersion system : 6.0 marshmallow"], "tags": ["applications", "system-error", "lg-g4", "application-error"]}
{"texts": ["Moto G 2nd Generation - Mobile Data is not working after the upgrade to Lollipop", "I have Moto G 2nd Generation phone. After upgrading to Lollipop, my mobile data is not working. It was previously working in KitKat.\n\nI contacted network providers and made sure everything is configured correctly. I also searched for a solution and couldn't find a solution for this.\n\nIs anyone else facing this issue? Is there a possible solution for this? Do I need to contact Motorola for a solution?"], "tags": ["5.0-lollipop", "mobile-data", "motorola-moto-g"]}
{"texts": ["SD card \"damaged\" after every reboot / power off", "When I turn off my phone, next time it says SD card is damaged and all data is gone, I can only reformat it. The phone is \"gionee iq275\" (also known as \"Fly\" in Russia), Android version is 2.3.4. What can be the source of problem? How can I get rid of it? I know, the phone is crap, but at the moment just throwing it away and buying another is not a solution."], "tags": ["boot", "reboot", "external-sd"]}
{"texts": ["Droid X: What are the pros/cons of upgrading to Gingerbread 2.3?", "I have a Droid X running Android 2.2.1 (system version 2.3.340.MB810.Verizon.en.US).  I want to upgrade to Gingerbread 2.3 but so far I've read one positive thread where people were happy with gingerbread and the rest is doom and gloom.\n\nI'm not really interested in doing any kind of rooting or custom ROM stuff I just want to know about the plain vanilla OTA update from Verizon (which my phone is currently asking me about).\n\nSo should I upgrade?  Or, to put it another way, what are the pros and cons of upgrading?\n\nEDIT\nA good answer would be like a bullet list of 5 or so negatives about Gingerbread and 5 or so positives.  A great answer would be an extensive list of the negatives and positives.  An amazing answer would add to that extensive list some anecdotal experience about the upgrade and whether they wish didn't upgrade or are glad they did and why.\n\nI originally title this question \"Droid X: Should I upgrade to Gingerbread 2.3?\" but in an effort to be less subjective I've reframed the question."], "tags": ["2.2-froyo", "2.3-gingerbread", "updates", "motorola-droid-x", "stock-android"]}
{"texts": ["just boot in recovery mode htc one xl", "Well, I have a htc onexl at&amp;t (evita) bootloader unlock and custom recovery TWRP \nwhen i try to turn on my phone he just boot in recovery, i can go to bootloader but i cant boot in system, is not a boot loop, he just go directly to recovery \n\nThis is what i did: \n\n\nUnlock bootloader\nInstall custom recovery TWRP 2.6.3.0\nThen I try to restart the phone and when he turn on he go directly to\nrecovery"], "tags": ["recovery-mode", "twrp", "htc-one-xl"]}
{"texts": ["Why does Android have antivirus apps while iOS does not?", "I have a Samsung Galaxy S2 and my friend has an iPhone.\n\nI have downloaded and installed the Norton Anti Virus app. I am at a loss to understand why iOS seemingly does not need protection as such. A smartphone, I have been told, is no less than a computer (even better, faster etc.), so need to be safeguarded.\n\nOr is there another reason why iOS has no AntiVirus apps while Android does?"], "tags": ["applications", "ios", "antivirus"]}
{"texts": ["Minimum lcd brightness on android 4.2.1", "I'm looking for a way to reduce the real brightness (the backlight) of my lcd. I'm using android 4.2.1 on a Star b94m/b943.\n\nI search for apps, and i found RootDim, which can decrease the light below the minimum 30/255 (default by android).\nI found another great app, Velis Auto Brightness, which allows to control the brightness in function of the light sensor. It can't go below the 30/255.\nSo i thought if there were a method to reduce the default android brightness i could use Velis Auto Brightness (so auto brightness) AND use lower than 30/255 levels.\n\nI tried this tweak of build.prop\n\nHow can I reduce screen brightness below the minimum without an app?\n\nbut it didn't work. Any other ideas?\n\nThank you!"], "tags": ["4.2-jelly-bean", "screen", "root-access", "screen-brightness"]}
{"texts": ["Can anyone explain Android storage space?", "My Hannspree tablet running Android 4.4.2 has 3 distinct storage locations: \n\n\nInternal storage - 1GB, \nInternal SD card - 12GB, \nRemovable SD card - 32GB. \n\n\nWhat's the point of the internal SD card if all the apps insist on using the Internal storage of 1GB? Most of that 1GB is occupied by Google apps I can't delete.\n\n\n\nMore information:   \n\nI thought I had moved all the apps that were possible, but I found a few more. Available space has now increased from 119MB to 190MB. With one exception, all the Google apps do not have that option and also many of the others including many of the real space hogs. \n\nThere's a trick I have found useful but its effects are temporary. What I do is uninstall all the Google app updates and that free up around 400MB. When the updates are reapplied, there is still an increase in space. Uninstalling and reinstalling apps like Firefox also has a useful result. \n\nThere seems to be some sort of software level sensor which says that space cannot be allowed to fall below about 100MB. Installing a new app with size 2MB or updating an existing one can fail when space left is 100MB. Perhaps you are familiar with Zinio. It quotes available space as 12GB and then puts data into the 1GB partition?"], "tags": ["storage"]}