{"texts": ["Why did the man steal the protagonist's lump?", "In the 1929 anime Kobu Tori, The protagonist has his facial deformation taken away by the tengu for being good entertainment and a welcome guest.\n\nWhen the antagonist follows in his footsteps, he goes to the tengu also to get rid of the lump on his own face.\n\n\n\nKobu Tori is a silent film, so I wasn't able to translate the dialogue and I don't understand why does the antagonist steals the protagonist's lump\n\n\n\nIs it to return it to him? To sell it?"], "tags": ["kobu-tori"]}
{"texts": ["Why was Bartholomew Kuma after Luffy's head at the conclusion of the Thriller Bark arc?", "Why did Bartholomew Kuma want to take Luffy's head after the Thriller Bark Arc? Wasn't he a member of Revolutionary Army and secretly working for his father Dragon? If it wasn't for Zoro, Luffy would have died."], "tags": ["one-piece"]}
{"texts": ["Differences between the Battle Angel: Alita manga and anime and the Alita: Battle Angel Live action", "I've watched the Alita Battle Angel Live Action, and though I couldnt watch most of the anime yet it doesnt seem to be exactly the same story. For example, I believe in the manga she was named Alita after the doctor deceased cat and in the Live Action she's named so after his deceased daughter. Are there many differences like this? Which are the differences between the Battle Angel: Alita manga and anime and the Alita: Battle Angel Live action?"], "tags": ["battle-angel-alita"]}
{"texts": ["Do the Sharingan dots decide their power/ family tree?", "In chapter 674 page 9, Madara says that Sasuke is the only one who awakened a Sharingan with straight commas, just like his. After that, he says that there might be a connection between them, something beyond blood.\n\n\n\n\nDoes this mean that an Uchiha can be distinguished by their Sharingan? Does this also mean that the power of their eye is decided by the type of commas (tomoe) they have?"], "tags": ["naruto"]}
{"texts": ["Why can Mitsuki see Shinigami?", "When Meroko and Takuto first appear to Mitsuki, they're extremely surprised that Mitsuki can see them since humans aren't supposed to be able to see Shinigami.\n\nIs it ever explained why Mitsuki can see them?"], "tags": ["full-moon-wo-sagashite"]}
{"texts": ["Will there be a season 4 of High School DxD anime?", "Will there be a season 4 of anime? Will it come out in 2017?\n\nI am a big fan of the anime. I want to know how it ends. Did he become the Harem King? Should I just read the novels?"], "tags": ["high-school-dxd"]}
{"texts": ["Who taught Megumin Explosion magic? Is she mentioned anywhere in the LN?", "I have read the KonoSuba Light Novel upto Volume.8 and also the Explosions aka Bakuen spinoff. In the start of the spinoff the writer mentions about a woman who used explosion in front of Megumin. After that she practically fell in love with Explosion magic and eventually learnt Explosion. Does the main series or any of the spinoff tell about this anonymous woman. If so, tell me where?"], "tags": ["konosuba"]}
{"texts": ["Whose eyes did Uchiha Madara use during the ninja war?", "I knew that Madara possesses the eyes of his brother to obtain Eternal Mangekyō Sharingan but is he still using those eyes during the Fourth Ninja World War? Or has he implanted different eyes?"], "tags": ["naruto"]}
{"texts": ["To what extent is Momonga living in the current world in which this anime is set?", "Did the human body of Momonga transform itself into his character in the game? If that's the case, his soul should be in this character.\n\nOr is it something similar to SAO in which his original body is still in the \"human world\", but his soul (or consciousness) in the \"game world\"?\n\nOr could it be that Momonga is with his soul and human body in his own world and sits in front of his computer playing this realistic game?"], "tags": ["overlord"]}
{"texts": ["Midoriya's power level against All Might", "How much percentage of Full Cowling Midoriya was using when he was fighting against All Might in the practical exam? At the last moment when he grabbed Bakugo and made his escape, I am pretty sure he was using more than 5%."], "tags": ["my-hero-academia"]}
{"texts": ["Would eating Tooru's tail make Kobayashi immortal?", "In the Miss Kobayashi's Dragon Maid manga it is stated by Tooru that eating her tail cures all ailments, but I have a very hard time believing that is all it does. In the anime Tooru sometimes thinks about the possibility that Kobayashi will eventually die despite the fact that Tooru has implied in the manga that she has access to some kind of fruit that makes humans immortal. Fafnir also told Shouta in chapter 14 of the Lucoa spinoff manga that bathing in his blood would make Shouta immortal.\nI'm asking hoping that someone with a ton of knowledge about dragon mythology could point me to a reference or something regarding the effects of eating part of a dragon. I've read pretty much everything related to the series except some of the Elma manga. I can't find one instance where the tail thing is explained aside from the one chapter where Tooru says it cures illness. I'm pretty sure Fafnir was an old European myth in real life, and maybe some of the other dragons are too. It might be possible to figure out the writer's intent if one knows the material that inspired some of the characters."], "tags": ["miss-kobayashis-dragon-maid"]}
{"texts": ["Why Ran did not recognise Shinichi right away?", "I recently started watching Detective Conan and I learned that Ran and Shinichi are in fact childhood friends. So my question is,  when Shinichi, due to the side effects of the drug he was forced to take, end up with the appearance of an elementary school student, why did Ran, who has known him since childhood not see the resemblance right away?"], "tags": ["detective-conan"]}
{"texts": ["What's the name of the first piece of music in Shingeki no Kyojin episode 1?", "In the 1st episode of SNK / AOT, there's this awesome song at 0:47, when the colossal titan appears. Do you know the name, please? I can't find it anywhere..."], "tags": ["attack-on-titan"]}
{"texts": ["Is there a direct connection between the characters' fates and the numbers on the helmets they wear?", "Numbers frequently have cultural meaning, which can include superstition and foreshadowing. Anime shows, being Asian-derived (Japanese, right), likely have more local meaning. China represents just one example of cultural number meanins (ref: wiki, chinese.SE)\n\nThe characters in Knights of Sidonia have numbers on their helmets, so I'm wondering if they are at all connected to the fates of the characters wearing them.\n\nFrom the Wikipedia article the digits \"2 and 8\" in a number mean \"double lucky\", while the digit \"0\" is also lucky and even. Inspection shows that Nagate Tanikaze's helmet contains these three values.\n\n\n\nThe digit \"6\" (in Cantonese) is supposed to mean \"to fall\" have some unlucky connotations.\n\n\n\nQuestion:\n\nIs there a direct connection between the characters' fates and the numbers on the helmets they wear? Please provide details, clarifications, and references as possible.\n\nPartial list of character names and helmet numbers:\n\n\nNagate Tanikaze, 028 in training, 704 as pilot\nShizuka Hoshijiro , 336 in training, 702 as pilot\nIzana Shinatose, 291 in training, 723 as pilot\nYuhata Midorikawa, 256 in training, moves to command.\nEiko Yamano, 290 as cadet, killed in action\nHinata Momose, unit designation 002, killed in action\nKashiwade Aoki, unit designation 003, killed in action\nIzumo Midorikawa, unit designation 004, killed in action\nIttan Samari, unit designation 005, often acting as field commander\nKoichi Tsuruuchi, unit designation 007, killed in action\nTonami, unit designation 005, killed in action\nIchiro Seii, unit designation 026, senior commander\nDo Imada, unit designation 139, killed in action with team (011, 217, and 312)\nEn Honoka, 203 as cadet, 703 as pilot, injured in action\nHo Honoka, unit designation 705, killed in action\nRen Honoka, unit designation 706, survives.\nNorio Kunato, 001 in training, 701 as pilot, murderer, killed by Ochiai"], "tags": ["knights-of-sidonia"]}
{"texts": ["Can 2 different species do a dance fusion and work?", "In episode 88th of Dragon Ball Super, in one subtitled version \n\n\n   Gohan asks Piccoro why dont they try a technique of fusion together. Note: this could be a bad translation because in another subtitled version he doesnt say exactly the same \n\n\nSo my question is , can 2 different species in Dragon Ball do a fusion dance and work? We know a fusion between 2 different people can work with the Potara earrings (for example a supreme kai and a witch) but what about fusion with the fusion dance? will something like that work?"], "tags": ["dragon-ball-series", "dragon-ball-z", "dragon-ball-super"]}
{"texts": ["Where is Pride's Homunculus tattoo?", "My brother and I were talking about the symbolism behind the location of the Homunculi's tattoo's location (i.e. Greed's is on his hand because he wants to get a hold of everything, Gluttony's is on his tongue because he wants to eat everything, etc.) and after reading all of the Fullmetal Alchemist manga three times over, neither of us could remember the location of Pride's Homunculus tattoo."], "tags": ["fullmetal-alchemist-series"]}
{"texts": ["Is the circle-script used in Rokka no Yuusha decipherable?", "In Rokka no Yuusha, we see a number of instances of a fictional script consisting of glyphs inside circles. For example, from the introductory narration:\n\n\n\n\n\nThese are probably too low-resolution to be readable. However, in episode 3, we get a suitably-high-resolution shot of Adlet's letter to the princess:\n\n\n\nFictional scripts in anime are often ciphers (a la Space Dandy, Suisei no Gargantia, etc.). Is this one also a cipher of some sort?"], "tags": ["rokka-no-yuusha"]}
{"texts": ["Which character has the most deaths to his/her name?", "In the Dragon Ball series, we see tons of people dying and being revived by the dragon balls.\nThis triggered my curiosity to know which character has the most deaths to his/her name in the whole Dragon Ball series. Who is it, and how many times did he/she die?"], "tags": ["dragon-ball-series"]}
{"texts": ["Does the \"bloody nose\" trope necessarily imply a sexual situation?", "If you've seen much anime, you're familiar with the male character getting a bloody nose when he gets sexually excited. For example:\n\n\n\n\nMaster Roshi (Dragon Ball) and Umino Iruka (Naruto)\n\nHowever, when I mentioned this to a Japanese person (someone who was not a big anime viewer), she was confused, and adamant that a bloody nose would normally just mean that the person was excited in general, and it would not necessarily have anything to do with sexual excitement.\n\nThis could (and seems likely to be) true for Japanese day to day real life, but very different in anime, where the connection to libido seems very clear.  \n\nIs there someone that can explain this difference? Is the \"bloody nose\" in anime just used to signify excitement, and it just happens to often (always) be sexual excitement because of the plot? Or is it supposed to be just understood how a bloody nose is interpreted in anime is different from normal life?"], "tags": ["tropes"]}
{"texts": ["Why did Kurama keep helping Naruto?", "As I was browsing through an old question, the answer shocked me. It seems that if Naruto were killed, Kurama would just revive. Then why did Kurama give Naruto some of its chakra when he was on the verge of death? For instance, when Naruto first summoned Gamabunta while falling to his potential death, Kurama gave him some chakra and helped him out. Wasn't Kurama's dream to break free from Naruto? What's the need of breaking the seal when he can just let Naruto die and he is free? He did push Naruto to the point of opening the gate when Naruto fought with Pain. Why not just sit tight and let Naruto die? Did I miss something? All this while I thought if the host dies so does the tailed beast."], "tags": ["naruto"]}
{"texts": ["Music in episode 10 of cowboy Bebop", "I would like to know if someone could tell me the name of a song in Cowboy Bebop, in episode 10, the one about Jet’s story?\nIt’s at the end of the episode at ~ 18:20 when he arrests his ex girlfriend and her new boyfriend.\nThanks you."], "tags": ["music", "cowboy-bebop"]}
{"texts": ["If father has spread his 7 sins in the form of Homunculi, what is left in himself?", "In Fullmetal Alchemist -Brotherhood we see that Father creates seven Homunculi, from his seven features which are actually seven deadly sins. (He said he wanted to get rid of these &quot;human&quot; weaknesses.) If these sins are extracted from the father so what is left inside him? Is Father more than a combination of seven deadly sins?"], "tags": ["fullmetal-alchemist-brotherhood", "seven-deadly-sins"]}
{"texts": ["Where can I watch The Seven Deadly Sins?", "I have seen the first 10 episodes of The Seven Deadly Sins, but now I cannot find the rest.\n\nWhere else can I watch it?"], "tags": ["seven-deadly-sins"]}
{"texts": ["What happened to Nausicaa at the end of the movie?", "In the final act of Nausicaa of the Valley of the Wind, \n\n\n   the titular character gets trampled by the Ohmu stampede and lies motionless. The Ohmu then stop their attack, pick her body up, and do something which wakes her up again. \n\n\nI seem to remember Miyazaki stating that he disliked that people found Messianic overtones in the movie.\n\n\n   Did Nausicaa die, and get resurrected by the Ohmu? Or was she simply badly hurt and the Ohum healed her?"], "tags": ["nausicaa-of-the-valley-of-the-wind"]}
{"texts": ["What's the name of Kuchiki Rukia's real parents?", "In Bleach, Kuchiki Rukia is said to be nurtured by the Kuchiki family. Can anyone tell me the names of her real parent?"], "tags": ["bleach"]}
{"texts": ["Has Saber, Arcuied, Shiki or any other Typemoon characters ever canonically meet one other within their respective story?", "In All Around Type-Moon spin-off manga. It was mentioned that Saber from Fate/Stay Night, Arcuied from Tsukihime and Shiki from Kara no Kyoukai are the three main heroine of Nasuverse and they meet each other there, saying long time no see. \n\nHave these three ever met before in their original story? Or if they weren't, is there any character, preferably the main characters, from their representative story meet each other?\n\n\n\nAnd by original story I mean in Fate/Stay Night visual novel, its prequel Fate/Zero and its sequel, Fate/Hollow Ataraxia, Tsukihime visual novel and Kara no Kyoukai light novel."], "tags": ["fate-series", "nasuverse", "type-moon", "all-around-type-moon"]}
{"texts": ["Girls dead monster songs?", "I can't find any girlsdemo songs with English sub they are the band from angel beats. Does anyone know a place I can find videos of all the girls dead monster songs with English subtitles?"], "tags": ["angel-beats"]}
{"texts": ["Have other series used picture cast credits besides The World is Still Beautiful?", "The closing credits of The World is Still Beautiful give their cast credits with pictures of each character, as they appear in that episode, along with the voice actor's name. (At least I am assuming that is what the text says.) For example, from episode 11:\n\n\n\nThis seems like an extremely good way to give credit, just as do many movies and live action TV shows. But it struck me that I don't remember any other anime series doing it. Have other series done so?"], "tags": ["anime-production", "soredemo-sekai-wa-utsukushii"]}
{"texts": ["What was the deal with Haruhi's Endless Eight?", "In Haruhi second season, there was 8 episodes that have been the same. The series of \"Endless Eight\" episodes are literally doing the same things over and over again. But it's not really the same thing, they re-animating and re-dubbing whole episode, they didn't being lazy and use the same source.\n\nHere's the same sequence of different episodes when Haruhi called Kyon to ask him to swim with others at the pool:\n\n\n\nAs you can see they give different tones, angles, outfits, etc. That's too much effort for same situation all over the episode for eight episodes straight. So why did they doing it? Did they also did it in light novel? What is the point of \"Endless Eight\"?"], "tags": ["haruhi-suzumiya"]}
{"texts": ["Why doesn't Minato use Sage mode against the \"Masked Man\"?", "We all know that Minato was able to use sage mode, but when the nine-tails attacked the hidden leaf, why didn't Minato go into sage mode and destroy the \"Masked Man\""], "tags": ["naruto"]}
{"texts": ["How does Natalia get from the baggage compartment to the cockpit?", "In Episode 19 of Fate Zero, Natalia is in the baggage compartment when the ghoul (bees) take over the cabin.\n\nHow does she manage to safely get into the cockpit?\n\n\n\nAFAIK, there is no way to get directly into the cockpit without going through the cabin. Thus it would be next to impossible for her to get into the cockpit without being overwhelmed by the bees.\n\n\n\nDoes the Manga shed any light on this?"], "tags": ["fate-zero"]}
{"texts": ["Could Caesar Clown have controlled Smoker?", "Smoker is a smoke man. He can \"create, control, and transform into smoke at will\" – One Piece wiki\n\nCaesar is a gas man. He can \"create, manipulate, and transform into gas at will.\" – One Piece wiki\n\nSince smoke is a gas, could Caesar control Smoker when he turns into smoke?"], "tags": ["one-piece"]}
{"texts": ["Why didn't Fuyumi and Hydra Bell fuse like their mothers did?", "From what I understand, When two opposite individuals (one from the human world and one from the demon world) touch each other, they are fused together to create one new individual that is made of the two of them. \n\nSo if Fuyumi and Hydra Bell are both the daughters of Nyen (Nene), why they didn't fuse when they touched each other?"], "tags": ["blood-lad"]}
{"texts": ["Which manga chapter does the season 1 of the anime end on?", "I just finished watching the first season of Nanatsu no Taizai (Seven Deadly Sins). I would like to continue by reading the manga but I am unsure which chapter to start from.\n\nAlso, I read online that there is a lot missing in the anime compared to the manga. Is that true?"], "tags": ["seven-deadly-sins"]}
{"texts": ["What is Saika constantly posting on the Message Board?", "I'm on the first season of Durarara!! (Coalgirls Subs), and on the Message Board Saika often posts random words like Love, Peace, Cut, etc. - All of which are subbed except for this repeated character.\nInitially I thought that Saika might be spamming with DESU DESU or something similar (I don't know why I thought that), but googling this didn't return any results.\nSo my question is, What is this word, Saika is constantly spamming the board with?"], "tags": ["japanese-language", "durarara"]}
{"texts": ["What does this borderline ki first Krilin and now Goku get mean?", "In Dragon Ball Super episode 76 Krilin had an aura ki we never seen before, it was drawed surrounding very closely his body:\n\n\n\n\n\nNow in the preview of Dragon Ball Super episode 98 we see Goku has the same aura:\n\n\n\n\n\nWhat does this borderline ki first Krilin and now Goku get mean? It's the only 2 times we've seen this kind of aura in the entire Dragon Ball universe."], "tags": ["dragon-ball-series", "dragon-ball-super"]}
{"texts": ["Do some Devil Fruits allow the user to swim in water?", "If someone had for example a \"wood\" devil fruit, his body would be entirely made out of wood. Would it be possible then to swim on the water, because naturally wood \"swims\" or at least floats in the water?\n\nOr does the sea eliminate his wood power and give him his normal body back, so he would drown?"], "tags": ["one-piece"]}
{"texts": ["Is it common for games to get a anime?", "A lot of anime are based off of the plot of a manga and/or light novels. Sometimes an anime is an original work that gets a manga story afterwards, but that isn't always the case.\n\nI remember watching Amagami, where you could obviously notice that it was based on a game, and some are even named after the games such as Final Fantasy.\n\nSo how common is it for a anime to be based of a game? I have only seen it once or twice but is it really that uncommon? Or are they just animated in a way that you won't directly notice that it comes from a game unless you already know so?"], "tags": ["anime-production", "anime-history"]}
{"texts": ["When do you classify an AMV as an ASMV?", "As the name 'Anime Story Music Video' explains, an AMV which contains a story is considered as an ASMV. But when do you declare something as a story?\n\nIs it necessary to have speeches in the video? If yes, to what extent? Do they have to underlay the very majority of the whole AMV or is it ok if they underlay only 1/4th of it?\n\nDo the speeches have to link each other directly or do they only have to contain the same emotions (e.g. desperation)?\n\nHere're a few examples of AMVs which could be considered as an ASMV:\n\n\nThis video is definitely an ASMV: https://www.youtube.com/watch?v=GmqVruTH0E4\nThis one starts its speeches after 53 sec. and these speeches only deliver the same emotions (they're not directly linked to each other if I understood it correctly): https://www.youtube.com/watch?v=JZhqrI3OGaM\nThis one has no speeches at all, but it tells us a story only with the compositing of anime scenes and the music: https://www.youtube.com/watch?v=LPDAZe84OJI"], "tags": ["terminology", "amv"]}
{"texts": ["How does Gankutsuou compare to the original book?", "Gankutsuou is based off the story, The Count of Monte Cristo.\n\n\n\nI haven't read the original novel, but I loved Gankutsuou. How close to the original are the plot line and characters? \n\nWas it a faithful rendition or was there some artistic license, because there were several scenes which, to me at least, seemed at odds with a book that would have been written in 1884. (Mostly futuristic elements)"], "tags": ["gankutsuou"]}
{"texts": ["Why did Jiraiya have to die?", "In Naruto, when Jiraiya fights Pain, he goes out of the barrier to confirm his suspicion about Pain (that all the 7 pains are dead) but he could have used a shadow clone instead. Shadow clones can transfer knowledge and experience (as told by Kakashi) and if Jiraiya had the chakra to maintain the barrier, swim when he is badly injured and then be alive just to write a message on the back of the toad (apparently I forgot the toad's name), he could have had the chakra to create a shadow clone. Why didn't he do so? [Why did he have die? I feel so sad about him :'( ]"], "tags": ["naruto"]}
{"texts": ["Can reanimated Chiyo use One's Own Life Reincarnation technique?", "Edo Tensei render a Shinobi immortal with endless supply of chakra, but can Edo Tensei Chiyo use her Reincarnation Technique to someone and do it many times (since she is immortal)?"], "tags": ["naruto"]}
{"texts": ["In Revolutionary Girl Utena, what's the power to revolutionize the world?", "I made this question before but since a single answer won't suffice, I have broke it down into different post as suggested by other users. TL;DR: I'm tring to understand the story, not the analogies.\n\nSo, What is the power to bring revolution? Is it actual power (like the type you see in shounen animes) or is it just an analogy about making the world accept behaviors like homosexuality and incest (as seen in events related with Akio &amp; Touga or Akio &amp; Anthy)?"], "tags": ["revolutionary-girl-utena"]}
{"texts": ["Are anime streaming sites legal?", "I don't think it should concern me, but I am still curious as to how legal anime streaming sites are. A popular site being AnimeUltima, I've watched probably 300+ different anime just from there. However, when asked if the site I use is legal, I usually respond with, \"yes,\" despite not knowing the answer; this is sort of annoying in itself.\n\nAnimeUltima as an example, is this site legally subbing and uploading anime?"], "tags": ["anime-production"]}
{"texts": ["How can one tell if Nappa has become a Super Saiyan?", "We can identify Super Saiyans by the change in the colour of their hair.\nWith Nappa being bald, how could we identify he has become a Super Saiyan? Is it only by the increase in power?"], "tags": ["dragon-ball-series"]}
{"texts": ["Did the Makers of the Lupin III \"Red-Jacket\" Series get Permission to Feature Superman?", "In one of the Episodes of the Lupin III part 2 \"Red-Jacket\" series, Lupin foils a scheme by Fujiko who has henchmen impersonating Superman to rob banks. \n\nI am curious if anyone has any information on whether this was technically allowed by DC, and if so, why?\n\nIf it wasn't allowed, then why is Crunchyroll.com able to screen this episode?\n\nHere is the imdb page for the episode. There is another earlier episode of the same series that also mentions Superman.\nhttps://www.imdb.com/title/tt0914728/"], "tags": ["copyright", "lupin-the-third"]}
{"texts": ["What happened to Yuuki at the end of the manga?", "In chapter 93, Yuuki was shown with Kaname and 2 girls. Are these 2 girls Yuuki and Zero's kids?\n\nWhat happened to Yuuki when she turned Kaname into a human? Is she dead like when her mother turned Yuuki into a human?\n\nWhat happened to Zero here?"], "tags": ["vampire-knight"]}
{"texts": ["In the sequence where Kazuo plays for Aihara, are both panels with a shifted style references to works of art?", "At the end of chapter 19 of Shindo, Kazuo Kikuna plays the piano for Kozue Aihara, his piano studio classmate, after their date. Uta Naruse listens as she passes Kazuo's house, and in two of the panels, she is drawn against a background with a markedly different art style:\n\n\n\n\n\nThe second panel clearly contains a reference to Gustav Klimt's The Kiss. With this in mind, is the first panel also a reference to a work of art? I tried looking at some other Klimt paintings to look for a similar image, but I couldn't find anything overly convincing, perhaps partly because I don't have a strong visual arts background."], "tags": ["shindo"]}
{"texts": ["What does the position of \"theme song assistance\"(?) entail?", "Over the past 3-4 years, I've been noticing a number of anime that credit a person named 外村敬一 (\"SOTOMURA Keiichi\", it seems) with 主題歌協力 - something like \"theme song assistance\". This credit, when present, usually appears on the same overlay as the four usual credits for the OP/ED song (vocalist, lyricist, arranger, composer). There are exceptions, though, like the Durarara!! Shou OP \"Headhunt\", where it appears on the following overlay.\n\nNote that the list of credits on ANN I linked to above is non-exhaustive - I'm pretty sure (just based on my vague recollection of having seen this guy's name over and over) there are a lot more credits for this Sotomura fellow that they haven't added to their database yet. For example, he is credited on \"Connect\" (the Madoka Magica TV OP), but isn't listed as such on ANN:\n\n\n\nTwo questions:\n\n\nWhat does this position entail?\nWhy have I never seen anyone besides Sotomura Keiichi be credited with it?"], "tags": ["anime-production"]}
{"texts": ["Where did Asuka think \"Monaka\" came from?", "In the bonus episode, the group of players who don't make the cut to play in the competition form a B-Squad named Monaka, after the first character of their three second-year members' names.\n\nWhen they announce this name to the rest of the club, Asuka misunderstands and thinks the name has something to do with youth:\n\n\n\n\n\n\n\n  Asuka: \"Monaka\". We're in the thick of our youth! Or something.\n  Girl: No, we just took the start of the second-years' names.\n\n\nWhere did Asuka think they had gotten the name \"Monaka\" from?"], "tags": ["japanese-language", "hibike-euphonium"]}
{"texts": ["How did Tepei draw his Livlaster without anyone noticing?", "The summoning of a Livlaster has a distinct light effect. It is shown that even behind cover, you can see the glare.\n\nThen at the fighting ring, Teppei is without the Livlaster when entering, but after Amara's entrance, Tepei is chastised by Daichi to hide it and \"this is not the place to use that\" stuff.\n\nHow could he summon the Livlaster (offscreen) without anyone in the audience noticing?"], "tags": ["captain-earth"]}
{"texts": ["Why Senku and Taiju revived from petrification when everybody else needed Senku's formula to revive?", "People who survived petrification were revived using Senku's formula, with the exception of Senku and Taiju. How were they able to revive without any formula?"], "tags": ["dr.stone"]}